app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def current_site_user
    user_id = decode[0]["user_id"]
    user = User.find(user_id)