app/controllers/coaches_controller.rb

SELECT "coaches".* FROM "coaches"
---
  def index
    @coaches = Coach.all

UPDATE "coaches" SET "name" = $1, "age" = $2, "location" = $3, "bio" = $4, "image" = $5, "updated_at" = $6 WHERE "coaches"."id" = $7  [["name", "jimmy john"], ["age", "27"], ["location", ""], ["bio", "BOBO"], ["image", "yoyoyo"], ["updated_at", "2020-12-01 19:40:18.078305"], ["id", 21]]
---
  def update
    if @coach.update(coach_params)

DELETE FROM "coaches" WHERE "coaches"."id" = $1  [["id", 18]]
---
  def destroy
    @coach.destroy

SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_coach
      @coach = Coach.find(params[:id])