app/controllers/enrolls_controller.rb

  def index
    @enrolls = Enroll.all
---
SELECT "enrolls".* FROM "enrolls"

  def create
    @enroll = Enroll.new(enroll_params)
    if @enroll.save
---
INSERT INTO "enrolls" ("firstname", "lastname", "phone", "email", "childname", "childage", "startdate", "enddate", "question", "consent", "created_at", "updated_at", "typeofday") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"