app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    if @location.save
---
INSERT INTO "locations" ("title", "time", "age_group", "image", "coach", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "East Village"], ["time", "No"], ["age_group", "No"], ["image", "No"], ["coach", ""], ["created_at", "2020-12-02 00:57:13.241380"], ["updated_at", "2020-12-02 00:57:13.241380"]]