app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "child_name", "email", "classes", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save